app/views/welcome/index.html.erb


          <a href="http://<%= film_obj.screenings.first.theater.website_url %>">
---
SELECT "screenings".* FROM "screenings" WHERE "screenings"."film_id" = $1  [["film_id", 1]]